Revit 2027 API
PostEventArgs Class
 The class is used as a base class for arguments of any post-event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitEventArgs
 Autodesk.Revit.DB.Events.PostEventArgs
 Autodesk.Revit.DB.Events.PostDocEventArgs
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PostEventArgs : RevitEventArgs
Public Class PostEventArgs
	Inherits RevitEventArgs
public ref class PostEventArgs : public RevitEventArgs
type PostEventArgs =
    class
        inherit RevitEventArgs
    end
The PostEventArgs type exposes the following members.
Properties
Name | Description
Cancel |  Indicates whether the event is being cancelled. When the event is cancellable, set the property to True to cancel it.
(Inherited from RevitEventArgs)
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitEventArgs)
Status |  Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an APIevent handler).
Top
Methods
Name | Description
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Events Namespace